# ExternalResourceType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceLoadData..::..ExternalResourceType Property
ExternalResourceLoadData Class See Also
---
The ExternalResourceType for which Revit is requesting data from the server.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ExternalResourceType ExternalResourceType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ExternalResourceType As ExternalResourceType
	Get
```

Visual C++
---
```text
public:
property ExternalResourceType^ ExternalResourceType {
	ExternalResourceType^ get ();
}
```

# See Also
ExternalResourceLoadData Class
Autodesk.Revit.DB Namespace